

// Исходная последовательность содержит сведения об абитуриентах. Каждый элемент
// последовательности включает следующие поля:
// <Фамилия> <Год поступления> <Номер школы>
// Для каждой школы вывести общее число абитуриентов за все годы и фамилию первого из абитуриентов
// этой школы, содержащихся в исходном наборе данных (вначале указывать номер школы, затем число
// абитуриентов, затем фамилию). Сведения о каждой школе выводить на новой строке и упорядочивать
// по возрастанию номеров школ.

public class Program
{
    static void Main()
    {
        
    }
}